WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_rotary_encoder.c
/****************************************************************************
 * nuttx\configs\stm32f777zit6-meadow\src\meadow_rotary_encoder.c
 * 
 *   Copyright (C) 2024 Wilderness Labs. All rights reserved.
 *   Author:  Wilderness Labs
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions
 * are met:
 *
 * 1. Redistributions of source code must retain the above copyright
 *    notice, this list of conditions and the following disclaimer.
 * 2. Redistributions in binary form must reproduce the above copyright
 *    notice, this list of conditions and the following disclaimer in
 *    the documentation and/or other materials provided with the
 *    distribution.
 * 3. Neither the name NuttX nor the names of its contributors may be
 *    used to endorse or promote products derived from this software
 *    without specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
 * "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
 * LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS
 * FOR A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE
 * COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING,
 * BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS
 * OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
 * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ****************************************************************************/

// This module contains code to handle rotary encoders at a higher speed than
// can be achieved using C#

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <meadow/hcom_shared_common.h>

#if MEADOW_INCLUDE_CODE_FOR_ROTARY_ENCODER > 0

#include <nuttx/config.h>
#include <string.h>
#include <stdbool.h>
#include <arch/board/board.h>
#include <nuttx/mqueue.h>
#include <errno.h>
#include "chip.h"
#include "stm32f777zit6-meadow.h"
#include <nuttx/timers/timer.h>
#include "stm32_tim.h"
#include <chip/stm32f76xx77xx_rcc.h>
#include <nuttx/clock.h>    // for testing
#include <nuttx/arch.h>
#include "meadow-upd.h"
#include "pwrmgmt/pwrmgmt_local.h"
#include <meadow/meadow_hw_version.h>

#include "meadow_rotary_encoder.h"

#if defined(CONFIG_QUICK_MISC_TESTS)
#pragma message "(--) meadow_rotary_encoder.c"
#endif

// #define USE_MEADOW_DEBUG_HELPERS
#undef USE_MEADOW_DEBUG_HELPERS
#include <meadow/meadow_debug_helpers.h>

//============================================================
// Set == 0 to disable diagnostic output via syslog
// Set == 1 for I/O and config diagnostic output
// Set == 2 or > to output all diagnostic output
#define MEADOW_ROTENC_INCLUDE_DIAGNOSTIC_SYSLOG (0)

// Arbitrary, large value, defining the maximum number of gpios that can be
// monitored.
#define MEADOW_ROTENC_MAX_SUPPORTED_GPIOS (32)

// FOR ROTARY ENCODER SPEED WILL NEED A TIMER UNLESS SOMEOTHER SCHEME IS USED
// THE TIMER CODE IS COPIED FROM 
// Timer 13 isn't much used in Meadow
// #define MEADOW_ROTENC_STM32F7_TIMER_NUMBER (13)

// Prescaler is be between 0 and 0xffff. A prescaler value of 0 to will
// not divide the input clock and a prescaler value of 1 will divide
// the clock by 2 etc.
// Timer 7's input clock is 96 MHz (1/2 of the STM32_SYSCLK_FREQUENCY speed).
// (prescaler + 1) * (auto reload register + 1) = TimerClock / frequency.
// The following values will give us a timer overflow interrupt every 0.1
// millisecond, which is the desired frequency
// #define MEADOW_ROTENC_RUNNING_PSC (959)
// #define MEADOW_ROTENC_RUNNING_ARR (9)

#if CONFIG_USEC_PER_TICK == 1000
#define MEADOW_ROTENC_TICK_MILLISEC_FACTOR (10)
#else
#define MEADOW_ROTENC_TICK_MILLISEC_FACTOR (1)
#endif

/****************************************************************************
 * Private Data
 ****************************************************************************/

static bool _firstTimeConfig = true;
// static struct stm32_tim_dev_s *_periodicTimer;

enum RequestedInterruptMode_e
{
  rqstdintmode_none,
  rqstdintmode_rising,
  rqstdintmode_falling,
  rqstdintmode_both
};

enum GPIOInterruptCfgType_e
{
  gpio_intrpt_cfg_type_remove   = 0,
  gpio_intrpt_cfg_type_rotenc_1 = 1,
  gpio_intrpt_cfg_type_rotenc_2 = 2,
  gpio_intrpt_cfg_type_rotenc_3 = 3,
  gpio_intrpt_cfg_type_rotenc_4 = 4
};

// All F7 possible input data registers addresses, used for ISR access to GPIO
// state value.
static uint32_t inputDataRegAddrs[] = 
{
  STM32_GPIOA_IDR,
  STM32_GPIOB_IDR,
  STM32_GPIOC_IDR,
  STM32_GPIOD_IDR,
  STM32_GPIOE_IDR,
  STM32_GPIOF_IDR,
  STM32_GPIOG_IDR,
  STM32_GPIOH_IDR,
  STM32_GPIOI_IDR,
  STM32_GPIOJ_IDR,
  STM32_GPIOK_IDR,
};
#define MEADOW_HW_INPUT_DATA_REGS_TOTAL (sizeof(inputDataRegAddrs) / sizeof(uint32_t))

struct rotencGpioInfo
{
  // Represents the CPU Pin identifier (e.g. PD9, D=3 so 39)
  uint8_t PinIdA;              // Supplied by configuration
  uint8_t PinIdB;              // Supplied by configuration

  // What is the configuration type for this?
  // 0 = remove, 1 = new, 2 = low-power sleep wakeup
  // uint8_t gpioUsage;         // Supplied by configuration

  // Address of correct "Input Data Register" which holds GPIO's hardware port
  // state bits
  uint32_t IDRAddressA;        // Calculated during configuration
  uint32_t IDRAddressB;        // Calculated during configuration

  uint8_t cfgEncoderNumb;        // 1-n
  bool cfgIsRotEncA;             // Interrupt for GPIO A = true 
  uint32_t prevCondBits;
  uint32_t prevOff;
  int activeCnt;
};

// This is the list of the GPIOs currently being timed. The entries in this
// list are very short lived, begin added as soon as the GPIO ISR is called and
// removed as soon as the glitch or debounce period has elapsed.
// static struct rotencGpioInfo *_allGpiosBeingTimed[MEADOW_ROTENC_MAX_SUPPORTED_GPIOS];

// This list keeps the address of all the allocated structures so they can be
// removed when the GPIO is removed
static struct rotencGpioInfo *_allRotaryEncodedGpios[MEADOW_ROTENC_MAX_SUPPORTED_GPIOS];

