WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_rotary_encoder.c
// // Indicates the total number of GPIOs currently being timed.
// static volatile int _allGpiosBeingTimedCnt = 0;

// Incremented and decrementd during configuration to indicate how many GPIOs
// need to be timed (only glitch and debounce GPIOs need to be timed).
static volatile int _totalGpiosCanBeTimed = 0;

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

// static int rotenc_config_interrupt_prep_timer(int stm32_timer_numb);
// static void meadow_rotenc_timer_enable(uint32_t timerBase);
// static inline int rotenc_forward_interrupt_to_core(struct rotencGpioInfo *rotencInfoAddr, uint8_t state);
static void rotenc_remove_from_timed_list_and_decr(struct rotencGpioInfo *rotencInfoAddr);
static int rotenc_config_interrupt_remove(struct rotenc_gpio_config* cfg,
          struct rotencGpioInfo *rotencInfoAddr);

// Basic timers need to turn on/off the timer a different way 
// NOT USED YET
// static void rotenc_turn_periodic_timer_on(void);
// static void rotenc_turn_periodic_timer_off(void);

static bool rotenc_get_current_gpio_state(struct rotencGpioInfo *rotencInfoAddr, bool isPinA);

// The rotary encoder has 2 inputs, called A and B. Because of its design
// either A or B changes but not both when the encoder is rotated. This is
// used to determine the direction. If A goes High before B then we are
// rotating one direction if B goes high before A we are rotating the other.
// For each change we must consider both the previous state of A and B and the
// current state of A and B. This can be used to represent 4-bit number.
// |old|new|
// |A|B|A|B|
//  3 2 1 0
// Bits 0 and 1 represent the current state of A and B and bits 2 and 3
// represent previous states of A and B. This 4-bit number yields 16 possible
// combination., however, there are combination that for which no change is
// represent. For example, the if bits 0-3 are all 0, this would mean that A
// was Low and is Low, and that B was Low and is Low (nothing changed.)

// This array of values determine the action to take with the current rotary
// count. Either add 1 or subtract 1 or do nothing.
static int RotEncLookup[] =
{
  // Notice the values forward and backward match
  0, -1, 1, 0, 1, 0, 0, -1, -1, 0, 0, 1, 0, 1, -1, 0
};

/****************************************************************************
 * Private Functions
 ****************************************************************************/

static void FindDirection(struct rotencGpioInfo *rotencInfoAddr, uint32_t newCondBits, char *pinUpDown)
{
  char *newDirStr;
  uint32_t prevOff = rotencInfoAddr->prevOff;

  // Shift 2 LS bits from previous to MS
  prevOff <<= 2;           // Move previous A & B to bits 2 & 3
  prevOff |= newCondBits;  // Add the new A or B in bits 0 & 1
  prevOff &= 0x0000000f;   // Save only lowest 4 bits
  
  // Use the new state bits to lookup direction
  int newDir = RotEncLookup[prevOff];
  rotencInfoAddr->prevOff = prevOff;

  int activeCnt = rotencInfoAddr->activeCnt;
  switch (newDir)
  {
    case 0: // no change
    default:
      return;
      // newDirStr = "-";
      // break; // show output even for 0

    case 1: // CW
      rotencInfoAddr->activeCnt++;
      newDirStr = "^";
      break;

    case -1: // CCW
      rotencInfoAddr->activeCnt--;
      newDirStr = "v";
      break;
  }

// if((_activeCnt1 % 9973) == 0)  // Only output text every x counts
//   {
    syslog(2, "%s-Total:%08d, %s\n",
                    pinUpDown,
                    rotencInfoAddr->activeCnt,
                    newDirStr);
//   }
}

// //===========================================================================
// // What is irq and context used for?
// static int rotenc_gpio_rot_enc_isr(int irq, void *context, void *arg)
// {
//   char *pinUpDown;
//   uint32_t newCondBits;
//   bool gpioState;
//   struct rotencGpioInfo *rotencInfoAddr = (struct rotencGpioInfo *)arg;

//   if(rotencInfoAddr->cfgIsRotEncA)
//   {
//     newCondBits = (rotencInfoAddr->prevCondBits) & 0x02;   // Save previous B state
//     gpioState = rotenc_get_current_gpio_state(rotencInfoAddr, true);
//     if(gpioState)
//     {
//       pinUpDown = "a^";
//       newCondBits |= 0x01;    // Set bit A
//     }
//     else
//     {
//       pinUpDown = "av";
//     }
//   }
//   else
//   {
//     newCondBits = (rotencInfoAddr->prevCondBits) & 0x01;
//     gpioState = rotenc_get_current_gpio_state(rotencInfoAddr, false);
//     if(gpioState)
//     {
//       pinUpDown = "b^";
//       newCondBits |= 0x02;    // Set bit B
//     }
//     else
//     {
//       pinUpDown = "bv";
//     }
//   }

//   // Only saves 2 ls bits
//   rotencInfoAddr->prevCondBits  = newCondBits;

//   FindDirection(rotencInfoAddr, newCondBits, pinUpDown);
//   return OK;
// }


//===========================================================================
int rotenc_gpio_rot_enc_isr_a(int irq, void *context, void *arg)
{
  char *pinUpDown;
  struct rotencGpioInfo *rotencInfoAddr = (struct rotencGpioInfo *)arg;

  uint32_t newCondBits = (rotencInfoAddr->prevCondBits) & 0x02;   // Save previous B state
  bool gpioState = rotenc_get_current_gpio_state(rotencInfoAddr, true);
  if(gpioState)
  {
    pinUpDown = "a^";
    newCondBits |= 0x01;    // Set bit A
  }
  else
  {
    pinUpDown = "av";
  }

  // Only saves 2 ls bits
  rotencInfoAddr->prevCondBits  = newCondBits;

  FindDirection(rotencInfoAddr, newCondBits, pinUpDown);
  return OK;
}

// ===========================================================================
int rotenc_gpio_rot_enc_isr_b(int irq, void *context, void *arg)
{
  char *pinUpDown;
  struct rotencGpioInfo *rotencInfoAddr = (struct rotencGpioInfo *)arg;

  uint32_t newCondBits = (rotencInfoAddr->prevCondBits) & 0x01;
  bool gpioState = rotenc_get_current_gpio_state(rotencInfoAddr, false);
  if(gpioState)
  {
    pinUpDown = "b^";
    newCondBits |= 0x02;    // Set bit B
  }
  else
  {
    pinUpDown = "bv";
  }
  
  // Only saves 2 ls bits
  rotencInfoAddr->prevCondBits  = newCondBits;

