WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_rotary_encoder.c
  FindDirection(rotencInfoAddr, newCondBits, pinUpDown);
  return OK;
}

// static void FindDirection1(uint32_t newStateBits, char *pinUpDown)
// {
//   // Move 2 LS bits from previous to MS
//   _prevOff1 <<= 2;           // Move previous A & B to bits 2 & 3
//   _prevOff1 |= newStateBits; // Add the new A or B in bits 0 & 1
//   _prevOff1 &= 0x0000000f;   // Save only lowest 4 bits

//   // Use the new state bits to lookup direction
//   int newDir = RotEncLookup[_prevOff1];
//   switch (newDir)
//   {
//     case 0: // no change
//     default:
//       return;

//     case 1: // CW
//       _activeCnt1++;
//       break;

//     case -1: // CCW
//       _activeCnt1--;
//      break;
//   }

// if((_activeCnt1 % 9973) == 0)  // Only output text every x counts
//   {
    // syslog(2, "%s-(+1) Total:%08d, %s\n",
    //                 pinUpDown, _activeCnt1, newDir == 1 ? " CW" : "CCW");
//   }
// }

// // These ISRs the 2 inputs from the rotary encoders
// int rotenc_gpio_rot_enc_isr_1a(int irq, void *context, void *arg)
// {
//   char *pinUpDown;
//   struct rotencGpioInfo *rotencInfoAddr = (struct rotencGpioInfo *)arg;

//   // Clear bit A, keep bit B
//   uint32_t newCondBits = _prevState1 & 0x02;   // Save previous B state

//   // GPIO now high?
//   if (rotenc_get_current_gpio_state(rotencInfoAddr))
//   {
//     pinUpDown = "a^";
//     newCondBits |= 0x01;    // Set bit A
//   }
//   else
//   {
//     pinUpDown = "av";
//   }

//   FindDirection1(newCondBits, pinUpDown);
//   return OK;
// }

// //===========================================================================
// int rotenc_gpio_rot_enc_isr_1b(int irq, void *context, void *arg)
// {
//   char *pinUpDown;
//   struct rotencGpioInfo *rotencInfoAddr = (struct rotencGpioInfo *)arg;

//   // Clear bit B bit, keep bit A
//   uint32_t newBBit = _prevState1 & 0x01;   // Save previous A state

//   // GPIO now high?
//   if (rotenc_get_current_gpio_state(rotencInfoAddr))
//   {
//     pinUpDown = "b^";
//     newBBit |= 0x02;              // Set bit B
//   }
//   else
//   {
//     pinUpDown = "bv";
//   }

//   FindDirection1(newBBit, pinUpDown);
//   return OK;
// }

// //===============================================================
// // Forward interrupt info to Meadow.Core
// int rotenc_forward_interrupt_to_core(struct rotencGpioInfo *rotencInfoAddr, uint8_t state)
// {
//   int ret;
//   extern mqd_t s_int_queue;
  
//   // Timing must be finished
//   DEBUG_SET_LOW(DEBUG_PIN_V2_A3);

//   // Forward to Meadow.Core
//   char queue_buffer[MINT_MSG_QUEUE_MSG_SIZE];
//   queue_buffer[0] = rotencInfoAddr->PinId;
//   queue_buffer[1] = state;

//   // This message queue is opened in
//   // /Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow-upd.c when the upd
//   // is opened
//   ret = mq_send(s_int_queue, queue_buffer, MINT_MSG_QUEUE_MSG_SIZE, 0);
//   if(ret < 0)
//   {
//     if(errno == ENOMEM)
//     {
//       syslog(LOG_ERR, "0x%02x Queue overflow (too fast?)\n", rotencInfoAddr->PinId);
//     }
//     else
//     {
//       syslog(LOG_ERR, "%s@%d-0x%02x mq_send failed:%d, errno:%d\n", __FILE__, __LINE__, 
//           rotencInfoAddr->PinId, ret, get_errno());
//     }
//   }

//   return ret;
// }

//===============================================================
bool rotenc_get_current_gpio_state(struct rotencGpioInfo *rotencInfoAddr, bool isPinA)
{
  uint8_t pinNumb;
  uint32_t idrRegisterValues;

  if(isPinA)
  {
    pinNumb = rotencInfoAddr->PinIdA & 0x0f;
    idrRegisterValues = *((uint32_t *)(rotencInfoAddr->IDRAddressA));
  }
  else
  {
    pinNumb = rotencInfoAddr->PinIdB & 0x0f;
    idrRegisterValues = *((uint32_t *)(rotencInfoAddr->IDRAddressB));
  }
  return (idrRegisterValues & (1 << pinNumb)) > 0 ? true : false;
}

// //===============================================================
// // We need to save the address of all allocated memory so it can be freed
// // when the GPIO is removed.
// static int rotenc_add_new_gpio_to_allocation_list(
//             struct rotencGpioInfo *rotencInfoAddr)
// {
//   for(int i = 0; i < MEADOW_ROTENC_MAX_SUPPORTED_GPIOS; i++)
//   {
//     // Find unused slot
//     if(_allRotaryEncodedGpios[i] == NULL)
//     {
//       _allRotaryEncodedGpios[i] = rotencInfoAddr;
//       return OK;
//     }
//   }
//   return -ENOSPC;   // No space
// }

//===============================================================
// When removing a GPIO we must find it's memory so it can be freed
static int rotenc_free_gpio_in_allocation_list(uint8_t pinId)
{
  for(int i = 0; i < MEADOW_ROTENC_MAX_SUPPORTED_GPIOS; i++)
  {
    // If NULL continue
    if(_allRotaryEncodedGpios[i] == NULL)
      continue;

    // Match the allocation
    // (--) THIS IS WRONG! A or B
    if(_allRotaryEncodedGpios[i]->PinIdA == pinId)
    {
      free(_allRotaryEncodedGpios[i]);
      _allRotaryEncodedGpios[i] = NULL;
      return OK;
    }
  }

  return -ENODATA;
}

//===============================================================
// Removes from the timer isr
void rotenc_remove_from_timed_list_and_decr(struct rotencGpioInfo *rotencInfoAddr)
{
//   int activeOffset;

  // Find the entry specified
//   for(activeOffset = 0; activeOffset < MEADOW_ROTENC_MAX_SUPPORTED_GPIOS; activeOffset++)
//   {
//     if(_allGpiosBeingTimed[activeOffset] == rotencInfoAddr)
//       break;
//   }

  // Was the item in the list?
//   if(activeOffset == MEADOW_ROTENC_MAX_SUPPORTED_GPIOS)
//     return;  // Not found

//   // Keep tally of entries
//   _allGpiosBeingTimedCnt--;

  // Is this the only entry?
//   if(activeOffset == _allGpiosBeingTimedCnt)
//   {
//     // Remove the last entry in the array
//     _allGpiosBeingTimed[activeOffset] = NULL;
//     return;
//   }
 
  // Compress the list by moving the last entry in the list to the slot we
  // are about to remove and then clearing the last slot.
//   _allGpiosBeingTimed[activeOffset] = _allGpiosBeingTimed[_allGpiosBeingTimedCnt];
//   _allGpiosBeingTimed[_allGpiosBeingTimedCnt] = NULL;
  return;
}

