WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_rotary_encoder.c
//=============================================================================
// Timer setup is here. This should only be called once to prepare timer for
// for periodic operation.
// Note: Timers 6 & 7 are Basic Timers. Timer 6 can be used to measure CPU idle
// time and Timer 7 is used here. Since neither timer has any GPIO this means
// other timers can be used for GPIO related work.
// static int rotenc_config_interrupt_prep_timer(int stm32_timer_numb)
// {
//   // int ret;
  
//   // Setup the clock enable
//   modifyreg32(STM32_RCC_APB1ENR, 0, RCC_APB1ENR_TIM7EN);
  
//   // Set prescaler and auto reload register to determine timer interrupt period
//   putreg16(MEADOW_ROTENC_RUNNING_PSC, STM32_TIM7_BASE + STM32_BTIM_PSC_OFFSET);
//   putreg16(MEADOW_ROTENC_RUNNING_ARR, STM32_TIM7_BASE + STM32_BTIM_ARR_OFFSET);

//   uint16_t regval = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
//   regval |= BTIM_CR1_ARPE;    // Auto Reload Pre-Load enable bit
//   putreg16(regval, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);

//   // Timer 7 only supports UIE interrupt
//   putreg16(BTIM_DIER_UIE, STM32_TIM7_BASE + STM32_BTIM_DIER_OFFSET);

//   // The ISR for periodic interupt for timing, will roll-over every 65536
//   // counts.
// // REMOVED SO IT WOULD BUILD
// //   ret = irq_attach(STM32_IRQ_TIM7, mint_isr_periodic, NULL);
// //   if(ret < 0)
// //   {
// //     syslog(LOG_ERR, "%s@%d-irq_attach failed, ret:%d, errno:%d\n",
// //           __FILE__, __LINE__, ret, errno);
// //     return ret;
// //   }

//   // Clear interrupt bit
//   uint16_t timStatusReg = getreg16(STM32_TIM7_BASE + STM32_GTIM_SR_OFFSET);
//   timStatusReg &= ~BTIM_SR_UIF;
//   putreg16(timStatusReg, STM32_TIM7_BASE + STM32_GTIM_SR_OFFSET);

//   up_enable_irq(STM32_IRQ_TIM7);

//   meadow_rotenc_timer_enable(STM32_TIM7_BASE);

//   return OK;
// }

//=============================================================
// Enables the timer
// void meadow_rotenc_timer_enable(uint32_t timerBase)
// {
//   // Why this order? tryed to copy the NUTTX order
//   uint16_t cr1Val = getreg16(timerBase + STM32_GTIM_CR1_OFFSET);
//   cr1Val |= GTIM_CR1_CEN;
  
//   uint16_t egrVal = getreg16(timerBase + STM32_GTIM_EGR_OFFSET);
//   egrVal |= GTIM_EGR_UG;

//   putreg16(egrVal, timerBase + STM32_GTIM_EGR_OFFSET);

//   putreg16(cr1Val, timerBase + STM32_GTIM_CR1_OFFSET);
// }

// NOT USED YET
// //=====================================================================
// // Setting the Counter Enable bit
// static void rotenc_turn_periodic_timer_on(void)
// {
//   uint16_t cr1Val = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
//   cr1Val |= BTIM_CR1_CEN;   // counter enable
//   putreg16(cr1Val, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
// }

// //=====================================================================
// static void rotenc_turn_periodic_timer_off(void)
// {
//   uint16_t cr1Val = getreg16(STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
//   cr1Val &= ~BTIM_CR1_CEN;   // counter enable
//   putreg16(cr1Val, STM32_TIM7_BASE + STM32_BTIM_CR1_OFFSET);
// }

/****************************************************************************
 * Public Functions
 ****************************************************************************/
// Called from meadow-upd.c to configure or remove a gpio for monitoring
// CALLED TWICE ONCE FOR EACH PIN A & B
int rotenc_config_interrupt(struct rotenc_gpio_config* cfg)
{
  int ret = OK;

  struct rotencGpioInfo *rotencInfoAddr;
  uint8_t pinDesignationA = cfg->portA << 4 | cfg->pinA;
  uint8_t pinDesignationB = cfg->portB << 4 | cfg->pinB;

  syslog(1, "Entered rotenc_config_interrupt\n");

  if(_firstTimeConfig)
  {
    // _allGpiosBeingTimedCnt = 0;
    _firstTimeConfig = false;

    for(int i = 0; i < MEADOW_ROTENC_MAX_SUPPORTED_GPIOS; i++)
    {
      _allRotaryEncodedGpios[i] = NULL;
    }

    // DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A0);    // True while in periodic isr
    // DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A1);    // True while in no delay isr
    // DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A2);    // True while in delay isr
    // DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A3);
    // DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A4);
    // DEBUG_CONFIGURE_PIN(DEBUG_PIN_V2_A5);
    
    // DEBUG_SET_LOW(DEBUG_PIN_V2_A0);
    // DEBUG_SET_LOW(DEBUG_PIN_V2_A1);
    // DEBUG_SET_LOW(DEBUG_PIN_V2_A2);
    // DEBUG_SET_LOW(DEBUG_PIN_V2_A3);
    // DEBUG_SET_LOW(DEBUG_PIN_V2_A4);
    // DEBUG_SET_LOW(DEBUG_PIN_V2_A5);

    // // Setup the timer once, the first time
    // ret = rotenc_config_interrupt_prep_timer(MEADOW_ROTENC_STM32F7_TIMER_NUMBER);
    // if(ret < 0)
    // {
    //   syslog(LOG_ERR, "mint-(cfg)-rotenc_config_interrupt_prep_timer failed, ret:%d\n", ret);
    //   return ret;
    // }
  }

  // Allocate memory for this GPIO's configuration and data storage needs
  rotencInfoAddr = (struct rotencGpioInfo *) zalloc(sizeof (struct rotencGpioInfo));
  if(rotencInfoAddr == NULL)
  {
    syslog(LOG_ERR, "%s@%d-malloc returned NULL\n", __FILE__, __LINE__);
    return -ENOMEM;
  }
  
  // We must set a few elements in the struct for this configuration
  rotencInfoAddr->PinIdA = pinDesignationA;
  rotencInfoAddr->PinIdB = pinDesignationB;
  // rotencInfoAddr->prevCondBits = 0;
  // rotencInfoAddr->prevOff = 0;
  // rotencInfoAddr->activeCnt = 0;

  // Find the correct offset for this GPIO
  rotencInfoAddr->IDRAddressA = inputDataRegAddrs[cfg->portA];
  rotencInfoAddr->IDRAddressB = inputDataRegAddrs[cfg->portB];

  // rotencInfoAddr->gpioUsage = cfg->configType;

  // Save the allocated memory so it can be freed when/if GPIO interrupt is
  // disposed of.
  // ret = rotenc_add_new_gpio_to_allocation_list(rotencInfoAddr);
  // if(ret < 0)
  // {
  //   syslog(LOG_ERR, "mint-(cfg)-rotenc_add_new_gpio_to_allocation_list, ret:%d\n", ret);
  //   return ret;
  // }

  // cfgset contains 20-bits of data. It is required by the Nuttx stm32_gpiosetevent
  // function. If the 20 bits of data are not correct, this Nuttx function will
  // reconfigure the GPIO based on whatever the data is in cfgset.
  // See stm32_gpio.h for more information.
  // Inputs: MMUU .... ...X PPPP BBBB
  // MM = Mode for input (this is 00)
  // UU = pull up, pull down or float
  // X  = configure as EXTI interrupt. Event or ISR set by stm32_gpiosetevent
  
  // Setup the Nuttx cfgset for this point to be configured by Nuttx
  uint32_t cfgsetA = (pinDesignationA & 0x000000ff);   // Set Port and Pin and clear MM
  uint32_t cfgsetB = (pinDesignationB & 0x000000ff);   // Set Port and Pin and clear MM
  switch(cfg->resistorMode)
  {
    case 0: // Float
      cfgsetA |= GPIO_FLOAT;
      cfgsetB |= GPIO_FLOAT;
      break;    // 0 = do nothing
    case 1: // Pull up
      cfgsetA |= GPIO_PULLUP;
      cfgsetB |= GPIO_PULLUP;
      break;
    case 2: // Pull down
      cfgsetA |= GPIO_PULLDOWN;
      cfgsetB |= GPIO_PULLDOWN;
      break;
  }

#if MEADOW_ROTENC_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_INFO, "mint-(cfg)- 0x%02x (P%c%d)-Cfg cfgset:0x%08x\n",
            rotencInfoAddr->PinId,
            ((rotencInfoAddr->PinId) >> 4) + 'A', rotencInfoAddr->PinId & 0x0f,
            cfgset);
#endif

  // Tell Nuttx about interrupt parameters
#if MEADOW_ROTENC_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_INFO, "mint-(cfg)-0x%02x (P%c%d)--Config Glitch\n", rotencInfoAddr->PinId,
              ((rotencInfoAddr->PinId) >> 4) + 'A', rotencInfoAddr->PinId & 0x0f);
#endif

  switch (cfg->configType)
  {
  case gpio_intrpt_cfg_type_remove:
    ret = rotenc_config_interrupt_remove(cfg, rotencInfoAddr);
    break;

  case gpio_intrpt_cfg_type_rotenc_1:
    rotencInfoAddr->cfgEncoderNumb = 1;
    break;

