WildernessLabs/Meadow/nuttx/configs/stm32f777zit6-meadow/src/meadow_rotary_encoder.c
  case gpio_intrpt_cfg_type_rotenc_2:
    rotencInfoAddr->cfgEncoderNumb = 2;
    break;

  default:
    break;
  }

  // Setup both input points to trigger isr
  rotencInfoAddr->cfgIsRotEncA = true;
  ret = stm32_gpiosetevent(
  cfgsetA,                      // Nuttx cfgset
  1,                            // risingEdge,
  1,                            // fallingEdge,
  0,                            // event
  rotenc_gpio_rot_enc_isr_a,      // ISR A
  rotencInfoAddr);              // Encoder information address

  rotencInfoAddr->cfgIsRotEncA = false;
  ret = stm32_gpiosetevent(
  cfgsetB,                      // Nuttx cfgset
  1,                            // risingEdge,
  1,                            // fallingEdge,
  0,                            // event
  rotenc_gpio_rot_enc_isr_b,      // ISR B
  rotencInfoAddr);              // Encoder information address

  return ret;
}

//========================================================================
// Remove an existing interrupt entry
int rotenc_config_interrupt_remove(struct rotenc_gpio_config* cfg,
          struct rotencGpioInfo *rotencInfoAddr)
{
  int ret;

  // Disable - remove a GPIO from being monitored
#if MEADOW_ROTENC_INCLUDE_DIAGNOSTIC_SYSLOG > 0
  syslog(LOG_INFO, "mint-(cfg)-0x%02x (P%c%d)--Removing GPIO\n", rotencInfoAddr->PinId,
              ((rotencInfoAddr->PinId) >> 4) + 'A', rotencInfoAddr->PinId & 0x0f);
#endif

  // Small chance but it might be actively timing
  rotenc_remove_from_timed_list_and_decr(rotencInfoAddr);

  // Tell Nuttx to forget about this interrupt
  ret = stm32_gpiosetevent(rotencInfoAddr->PinIdA, 0, 0, 0, NULL, NULL);

  // This call will free the memory allocated when this GPIO was originally
  // configured
  ret = rotenc_free_gpio_in_allocation_list(rotencInfoAddr->PinIdA);
  if(ret < 0)
  {
    syslog(LOG_ERR, "%s@%d-rotenc_free_gpio_in_allocation_list returned, ret:%d\n",
              __FILE__, __LINE__, ret);
    // Reported error might as well finish removing GPIO
  }

  free(rotencInfoAddr);
  return ret;
}

#endif      // #if MEADOW_INCLUDE_CODE_FOR_ROTARY_ENCODER > 0
